artifacts/oscar_e2e/fig4_right_qwen3_8b_cached/bf16/in100000_bs32/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31002, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31002/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31002, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model='Qwen/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /root/.cache/sglang/benchmark/gen_shared_prefix_1_1_32_100000_128_1000_Qwen2Tokenizer.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  122.28    
Total input tokens:                      3371395   
Total input text tokens:                 3371395   
Total generated tokens:                  32000     
Total generated tokens (retokenized):    11675     
Request throughput (req/s):              0.26      
Input token throughput (tok/s):          27571.14  
Output token throughput (tok/s):         261.69    
Peak output token throughput (tok/s):    1608.00   
Peak concurrent requests:                32        
Total token throughput (tok/s):          27832.84  
Concurrency:                             31.05     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   118639.57 
Median E2E Latency (ms):                 119628.29 
P90 E2E Latency (ms):                    121893.67 
P99 E2E Latency (ms):                    122164.38 
---------------Time to First Token----------------
Mean TTFT (ms):                          9482.39   
Median TTFT (ms):                        9745.29   
P99 TTFT (ms):                           9853.47   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          109.27    
Median TPOT (ms):                        110.09    
P99 TPOT (ms):                           112.43    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           109.27    
Median ITL (ms):                         115.70    
P95 ITL (ms):                            116.65    
P99 ITL (ms):                            131.01    
Max ITL (ms):                            4119.43   
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [01:50<57:20, 111.00s/it]
  6%|▋         | 2/32 [01:51<23:05, 46.18s/it] 
  9%|▉         | 3/32 [01:52<12:18, 25.46s/it]
 12%|█▎        | 4/32 [01:53<07:24, 15.86s/it]
 16%|█▌        | 5/32 [01:54<04:40, 10.37s/it]
 19%|█▉        | 6/32 [01:55<03:03,  7.05s/it]
 22%|██▏       | 7/32 [01:55<02:03,  4.95s/it]
 25%|██▌       | 8/32 [01:56<01:26,  3.61s/it]
 28%|██▊       | 9/32 [01:56<01:00,  2.63s/it]
 31%|███▏      | 10/32 [01:57<00:43,  1.96s/it]
 34%|███▍      | 11/32 [01:57<00:31,  1.52s/it]
 38%|███▊      | 12/32 [01:58<00:23,  1.19s/it]
 41%|████      | 13/32 [01:58<00:18,  1.04it/s]
 44%|████▍     | 14/32 [01:59<00:14,  1.28it/s]
 47%|████▋     | 15/32 [01:59<00:10,  1.60it/s]
 50%|█████     | 16/32 [01:59<00:08,  1.94it/s]
 53%|█████▎    | 17/32 [01:59<00:06,  2.28it/s]
 56%|█████▋    | 18/32 [02:00<00:05,  2.60it/s]
 59%|█████▉    | 19/32 [02:00<00:04,  2.68it/s]
 62%|██████▎   | 20/32 [02:00<00:04,  2.94it/s]
 66%|██████▌   | 21/32 [02:00<00:03,  3.40it/s]
 69%|██████▉   | 22/32 [02:01<00:02,  4.01it/s]
 72%|███████▏  | 23/32 [02:01<00:01,  4.59it/s]
 75%|███████▌  | 24/32 [02:01<00:01,  5.12it/s]
 78%|███████▊  | 25/32 [02:01<00:01,  5.57it/s]
 81%|████████▏ | 26/32 [02:01<00:01,  5.94it/s]
 88%|████████▊ | 28/32 [02:01<00:00,  7.42it/s]
 91%|█████████ | 29/32 [02:01<00:00,  7.32it/s]
 97%|█████████▋| 31/32 [02:02<00:00,  8.32it/s]
100%|██████████| 32/32 [02:02<00:00,  8.64it/s]
100%|██████████| 32/32 [02:02<00:00,  3.82s/it]